In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame([[1,2,3], [4,5,6]], columns=['A', 'B', 'C'])

In [6]:
df.head()

   A  B  C
0  1  2  3
1  4  5  6

In [7]:
df.tail(1)

   A  B  C
1  4  5  6

In [8]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
df.index.tolist()

[0, 1]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      int64
 1   B       2 non-null      int64
 2   C       2 non-null      int64
dtypes: int64(3)
memory usage: 180.0 bytes

In [11]:
df.describe()

             A        B        C
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [12]:
df.nunique()

A    2
B    2
C    2
dtype: int64

In [13]:
df['A'].nunique()

2

In [14]:
df.shape

(2, 3)

In [15]:
coffee_df = pd.read_csv('./warmup-data/coffee.csv')

In [16]:
coffee_df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [17]:
display(coffee_df)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [18]:
coffee_df.sample(3)

       Day Coffee Type  Units Sold
9   Friday       Latte          35
0   Monday    Espresso          25
3  Tuesday       Latte          20

In [19]:
# # coffee_df.loc[#Rows, #Cols]
# # coffee_df.loc[0:1]

# coffee_df.loc[0:10, "Day"]

coffee_df.loc[0:10, ["Day", "Coffee Type"]]

          Day Coffee Type
0      Monday    Espresso
1      Monday       Latte
2     Tuesday    Espresso
3     Tuesday       Latte
4   Wednesday    Espresso
5   Wednesday       Latte
6    Thursday    Espresso
7    Thursday       Latte
8      Friday    Espresso
9      Friday       Latte
10   Saturday    Espresso

In [20]:
coffee_df.iloc[:, [0,2]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [21]:
coffee_df.index = coffee_df.Day

In [22]:
coffee_df.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [23]:
coffee_df.loc["Monday"]

           Day Coffee Type  Units Sold
Day
Monday  Monday    Espresso          25
Monday  Monday       Latte          15

In [24]:
coffee_df.loc["Monday" : "Friday", "Units Sold"]

Day
Monday       25
Monday       15
Tuesday      30
Tuesday      20
Wednesday    35
Wednesday    25
Thursday     40
Thursday     30
Friday       45
Friday       35
Name: Units Sold, dtype: int64

In [25]:
coffee_df.iloc[:, 2:]

           Units Sold
Day
Monday             25
Monday             15
Tuesday            30
Tuesday            20
Wednesday          35
Wednesday          25
Thursday           40
Thursday           30
Friday             45
Friday             35
Saturday           45
Saturday           35
Sunday             45
Sunday             35

In [26]:
coffee_df.iloc[1, 2] = 10

In [27]:
coffee_df

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          10
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [28]:
coffee_df.at["Monday", "Units Sold"]

Day
Monday    25
Monday    10
Name: Units Sold, dtype: int64

In [29]:
coffee_df.iat[0, 2]

np.int64(25)

In [30]:
coffee_df.iloc[0, 2]

np.int64(25)

In [31]:
coffee_df.Day

Day
Monday          Monday
Monday          Monday
Tuesday        Tuesday
Tuesday        Tuesday
Wednesday    Wednesday
Wednesday    Wednesday
Thursday      Thursday
Thursday      Thursday
Friday          Friday
Friday          Friday
Saturday      Saturday
Saturday      Saturday
Sunday          Sunday
Sunday          Sunday
Name: Day, dtype: object

In [32]:
coffee_df.sort_values("Units Sold", ascending=False)

                 Day Coffee Type  Units Sold
Day
Saturday    Saturday    Espresso          45
Friday        Friday    Espresso          45
Sunday        Sunday    Espresso          45
Thursday    Thursday    Espresso          40
Wednesday  Wednesday    Espresso          35
Saturday    Saturday       Latte          35
Sunday        Sunday       Latte          35
Friday        Friday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Wednesday  Wednesday       Latte          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          10

In [33]:
coffee_df.sort_values(["Units Sold", "Coffee Type"], ascending=[0, True])

                 Day Coffee Type  Units Sold
Day
Friday        Friday    Espresso          45
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Thursday    Thursday    Espresso          40
Wednesday  Wednesday    Espresso          35
Friday        Friday       Latte          35
Saturday    Saturday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Wednesday  Wednesday       Latte          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          10

In [34]:
for index, row in coffee_df.iterrows():
    print(index, " row: ", row)
    print("\n\n")

Monday  row:  Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: Monday, dtype: object



Monday  row:  Day            Monday
Coffee Type     Latte
Units Sold         10
Name: Monday, dtype: object



Tuesday  row:  Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: Tuesday, dtype: object



Tuesday  row:  Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: Tuesday, dtype: object



Wednesday  row:  Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: Wednesday, dtype: object



Wednesday  row:  Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: Wednesday, dtype: object



Thursday  row:  Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: Thursday, dtype: object



Thursday  row:  Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: Thursday, dtype: object



Friday  row:  Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: Friday, dtype: object



Friday  row:  Day            Friday
Coffee Type     Latte
Units Sold         35
Name: Friday, dtype: object



Saturday  row:  Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: Saturday, dtype: object



Saturday  row:  Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: Saturday, dtype: object



Sunday  row:  Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: Sunday, dtype: object



Sunday  row:  Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: Sunday, dtype: object

Filtering Rows

In [35]:
bios = pd.read_csv('./data/bios.csv')

In [36]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [37]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [38]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [39]:
bios.isna().sum()

athlete_id           0
name                 0
born_date         1807
born_city        34592
born_region      34592
born_country     34592
NOC                  1
height_cm        38849
weight_kg        43430
died_date       111560
dtype: int64

In [43]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [55]:
bios.loc[bios['height_cm'] > 180, ["name", 'born_date', 'born_region']]

                     name   born_date           born_region
1          Arnaud Boetsch  1969-04-01              Yvelines
2            Jean Borotra  1898-08-13  Pyrnes-Atlantiques
5       Nicolas Chatelain  1970-01-13                 Somme
16             Guy Forget  1965-01-04     Casablanca-Settat
25          Henri Leconte  1963-07-04         Pas-de-Calais
...                   ...         ...                   ...
145465  Stanislav Galiyev  1992-01-17                Moskva
145466     Mikkel Aagaard  1995-10-18           Nordjylland
145468  Justin Abdelkader  1987-02-25              Michigan
145473     Toms Andersons  1993-11-25                  Rga
145494      George Wright  1890-07-21               Ontario

[35368 rows x 3 columns]

In [60]:
bios[(bios['height_cm'] > 215) & (bios['born_country']=='USA')][['name', 'NOC']]

                    name            NOC
5781      Tommy Burleson  United States
6722    Shaquille O'Neal  United States
6937      David Robinson  United States
123850    Tyson Chandler  United States

In [62]:
bios[bios['name'].str.contains('Keith', case = False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [64]:
bios[bios['born_country'].isin(["USA", "FRA", "GBR"])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,Brianon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18

In [65]:
bios.query('born_country == "USA"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145445,149168,Kristen Santos,1994-11-02,Fairfield,Connecticut,USA,United States,NaN,NaN,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN

### Adding/Removing Columns

In [66]:
coffee_df.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          10
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [67]:
coffee_df['price'] = 4.99

In [68]:
import numpy as np

In [70]:
coffee_df['new_price'] = np.where(coffee_df['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [71]:
coffee_df.head()

                 Day Coffee Type  Units Sold  price  new_price
Day
Monday        Monday    Espresso          25   4.99       3.99
Monday        Monday       Latte          10   4.99       5.99
Tuesday      Tuesday    Espresso          30   4.99       3.99
Tuesday      Tuesday       Latte          20   4.99       5.99
Wednesday  Wednesday    Espresso          35   4.99       3.99

In [76]:
coffee_df.drop(columns=['price'])
coffee_df

                 Day Coffee Type  Units Sold  price  new_price
Day
Monday        Monday    Espresso          25   4.99       3.99
Monday        Monday       Latte          10   4.99       5.99
Tuesday      Tuesday    Espresso          30   4.99       3.99
Tuesday      Tuesday       Latte          20   4.99       5.99
Wednesday  Wednesday    Espresso          35   4.99       3.99
Wednesday  Wednesday       Latte          25   4.99       5.99
Thursday    Thursday    Espresso          40   4.99       3.99
Thursday    Thursday       Latte          30   4.99       5.99
Friday        Friday    Espresso          45   4.99       3.99
Friday        Friday       Latte          35   4.99       5.99
Saturday    Saturday    Espresso          45   4.99       3.99
Saturday    Saturday       Latte          35   4.99       5.99
Sunday        Sunday    Espresso          45   4.99       3.99
Sunday        Sunday       Latte          35   4.99       5.99

In [79]:
# coffee_df.drop(columns=['price'], inplace = True)
coffee_df

                 Day Coffee Type  Units Sold  new_price
Day
Monday        Monday    Espresso          25       3.99
Monday        Monday       Latte          10       5.99
Tuesday      Tuesday    Espresso          30       3.99
Tuesday      Tuesday       Latte          20       5.99
Wednesday  Wednesday    Espresso          35       3.99
Wednesday  Wednesday       Latte          25       5.99
Thursday    Thursday    Espresso          40       3.99
Thursday    Thursday       Latte          30       5.99
Friday        Friday    Espresso          45       3.99
Friday        Friday       Latte          35       5.99
Saturday    Saturday    Espresso          45       3.99
Saturday    Saturday       Latte          35       5.99
Sunday        Sunday    Espresso          45       3.99
Sunday        Sunday       Latte          35       5.99

In [83]:
coffee_df.drop(columns = 'Day', inplace = True)

In [84]:
coffee_df['revenue'] = coffee_df['Units Sold'] * coffee_df['new_price']

In [85]:
coffee_df.head()

          Coffee Type  Units Sold  new_price  revenue
Day
Monday       Espresso          25       3.99    99.75
Monday          Latte          10       5.99    59.90
Tuesday      Espresso          30       3.99   119.70
Tuesday         Latte          20       5.99   119.80
Wednesday    Espresso          35       3.99   139.65

In [88]:
coffee_df.rename(columns = {'new_price' : 'price'}, inplace = True)

In [89]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [90]:
bios_new = bios.copy()

In [91]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [92]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [94]:
bios_new.query('first_name == "Keith"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [96]:
pd.to_datetime(bios_new['born_date']).info()

<class 'pandas.core.series.Series'>
RangeIndex: 145500 entries, 0 to 145499
Series name: born_date
Non-Null Count   Dtype
--------------   -----
143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 1.1 MB

In [98]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [99]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17

In [100]:
bios_new['born_datetime'].dt.year

0         1886.0
1         1969.0
2         1898.0
3         1895.0
4         1878.0
           ...
145495    2002.0
145496    1999.0
145497    1998.0
145498    1899.0
145499    1913.0
Name: born_datetime, Length: 145500, dtype: float64

In [107]:
bios_new['born_datetime'].dt.year.fillna(0).astype(int)

0         1886
1         1969
2         1898
3         1895
4         1878
          ...
145495    2002
145496    1999
145497    1998
145498    1899
145499    1913
Name: born_datetime, Length: 145500, dtype: int64

In [109]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year.fillna(0).astype(int)

In [110]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878

In [111]:
bios_new['height_category'] = bios_new['height_cm'].apply(lambda x : 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

In [112]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year,height_category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878,Tall

### Merging and Concat

In [114]:
nocs = pd.read_csv('./data/noc_regions.csv')

In [115]:
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [116]:
bios_new_merged = pd.merge(bios, nocs, left_on = 'born_country', right_on = 'NOC', how = 'left')

In [117]:
bios_new_merged.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [118]:
pd.merge(bios, nocs, left_on = 'born_country', right_on = 'NOC', how = 'right')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,57056.0,Mohammad Ebrahimi,1930-04-11,Kabul,Kabul,AFG,Afghanistan,160.0,63.0,2022-05-22,AFG,Afghanistan,NaN
1,57062.0,Kayum Ayub,1947-06-21,Kabul,Kabul,AFG,Afghanistan,176.0,78.0,NaN,AFG,Afghanistan,NaN
2,57064.0,Aka-Jahan Dastagir,1946-06-05,Kabul,Kabul,AFG,Afghanistan,170.0,70.0,NaN,AFG,Afghanistan,NaN
3,57065.0,Ghulam Dastagir,1945-07-24,Kabul,Kabul,AFG,Afghanistan,180.0,87.0,NaN,AFG,Afghanistan,NaN
4,57066.0,Ahmad Djan,1948-02-10,Kabul,Kabul,AFG,Afghanistan,165.0,52.0,NaN,AFG,Afghanistan,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
110661,147637.0,Donata Katai,2004-05-07,Harare,Harare,ZIM,Zimbabwe,NaN,NaN,NaN,ZIM,Zimbabwe,NaN
110662,147638.0,Ngoni Makusha,1994-06-29,Chitungwiza,Harare,ZIM,Zimbabwe,NaN,NaN,NaN,ZIM,Zimbabwe,NaN
110663,147639.0,Scott Vincent,1992-05-20,Harare,Harare,ZIM,Zimbabwe,181.0,NaN,NaN,ZIM,Zimbabwe,NaN
110664,147640.0,Peter Purcell-Gilpin,1994-07-04,Harare,Harare,ZIM,Zimbabwe,189.0,84.0,NaN,ZIM,Zimbabwe,NaN
110665,147641.0,Peter Wetzlar,1997-02-27,Harare,Harare,ZIM,Zimbabwe,NaN,NaN,NaN,ZIM,Zimbabwe,NaN

In [120]:
bios_new_merged.rename({'region' : 'born_country_full'}, inplace = True)

In [121]:
usa = bios[bios['born_country']=='USA'].copy()
gbr = bios[bios['born_country']=='GBR'].copy()

In [122]:
new_df = pd.concat([usa, gbr])

In [123]:
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN

In [124]:
coffee_df.isna().sum()

Coffee Type    0
Units Sold     0
price          0
revenue        0
dtype: int64

In [133]:
coffee_df[]

          Coffee Type  Units Sold  price  revenue
Day
Monday       Espresso          25   3.99    99.75
Monday          Latte          10   5.99    59.90
Tuesday      Espresso          30   3.99   119.70
Tuesday         Latte          20   5.99   119.80
Wednesday    Espresso          35   3.99   139.65
Wednesday       Latte          25   5.99   149.75
Thursday     Espresso          40   3.99   159.60
Thursday        Latte          30   5.99   179.70
Friday       Espresso          45   3.99   179.55
Friday          Latte          35   5.99   209.65
Saturday     Espresso          45   3.99   179.55
Saturday        Latte          35   5.99   209.65
Sunday       Espresso          45   3.99   179.55
Sunday          Latte          35   5.99   209.65

### Aggregation

In [134]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Kirovgrad             1
Pereiaslav            1
Podgornyy             1
Kudepsta              1
Furmanov              1
Name: count, Length: 22368, dtype: int64

In [135]:
bios[bios['born_country'] =='USA']['born_region'].value_counts().head()

born_region
California       1634
New York          990
Illinois          585
Massachusetts     530
Pennsylvania      530
Name: count, dtype: int64

In [138]:
coffee_df.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    265
Latte       190
Name: Units Sold, dtype: int64

In [139]:
coffee_df.groupby(['Coffee Type'])['Units Sold'].mean()

Coffee Type
Espresso    37.857143
Latte       27.142857
Name: Units Sold, dtype: float64

In [140]:
coffee_df.groupby(['Coffee Type', 'Day']).agg({'Units Sold' : 'sum', 'price' : 'mean'})

                       Units Sold  price
Coffee Type Day
Espresso    Friday             45   3.99
            Monday             25   3.99
            Saturday           45   3.99
            Sunday             45   3.99
            Thursday           40   3.99
            Tuesday            30   3.99
            Wednesday          35   3.99
Latte       Friday             35   5.99
            Monday             10   5.99
            Saturday           35   5.99
            Sunday             35   5.99
            Thursday           30   5.99
            Tuesday            20   5.99
            Wednesday          25   5.99

### Pivot Tables

In [144]:
pivot = coffee_df.pivot(columns='Coffee Type', values='revenue')

In [145]:
pivot.head()

Coffee Type  Espresso   Latte
Day
Friday         179.55  209.65
Monday          99.75   59.90
Saturday       179.55  209.65
Sunday         179.55  209.65
Thursday       159.60  179.70

In [146]:
pivot.sum()

Coffee Type
Espresso    1057.35
Latte       1138.10
dtype: float64

In [147]:
pivot.sum(axis = 1)

Day
Friday       389.20
Monday       159.65
Saturday     389.20
Sunday       389.20
Thursday     339.30
Tuesday      239.50
Wednesday    289.40
dtype: float64

In [148]:
bios.groupby(bios['born_date'].dt.year)['name'].count()

Unexpected exception formatting exception. Falling back to standard exception

Traceback (most recent call last):
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\interactiveshell.py", line 3553, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
    ~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\Jitto\AppData\Local\Temp\ipykernel_29592\1771076168.py", line 1, in <module>
    bios.groupby(bios['born_date'].dt.year)['name'].count()
                 ^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\pandas\core\generic.py", line 6321, in __getattr__
    return object.__getattribute__(self, name)
           ~~~~~~~~~~~~~~~~~~~~~~~^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\pandas\core\accessor.py", line 224, in __get__
    accessor_obj = self._accessor(obj)
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\pandas\core\indexes\accessors.py", line 643, in __new__
    raise AttributeError("Can only use .dt accessor with datetimelike values")
AttributeError: Can only use .dt accessor with datetimelike values. Did you mean: 'at'?

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\interactiveshell.py", line 2144, in showtraceback
    stb = self.InteractiveTB.structured_traceback(
        etype, value, tb, tb_offset=tb_offset
    )
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\ultratb.py", line 1435, in structured_traceback
    return FormattedTB.structured_traceback(
           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~^
        self, etype, evalue, etb, tb_offset, number_of_lines_of_context
        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
    )
    ^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\ultratb.py", line 1326, in structured_traceback
    return VerboseTB.structured_traceback(
           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~^
        self, etype, value, tb, tb_offset, number_of_lines_of_context
        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
    )
    ^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\ultratb.py", line 1173, in structured_traceback
    formatted_exception = self.format_exception_as_a_whole(etype, evalue, etb, number_of_lines_of_context,
                                                           tb_offset)
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\ultratb.py", line 1063, in format_exception_as_a_whole
    self.get_records(etb, number_of_lines_of_context, tb_offset) if etb else []
    ~~~~~~~~~~~~~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\IPython\core\ultratb.py", line 1160, in get_records
    res = list(stack_data.FrameInfo.stack_data(etb, options=options))[tb_offset:]
          ~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\stack_data\core.py", line 597, in stack_data
    yield from collapse_repeated(
    ...<4 lines>...
    )
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\stack_data\utils.py", line 83, in collapse_repeated
    yield from map(mapper, original_group)
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\stack_data\core.py", line 587, in mapper
    return cls(f, options)
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\stack_data\core.py", line 551, in __init__
    self.executing = Source.executing(frame_or_tb)
                     ~~~~~~~~~~~~~~~~^^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\executing\executing.py", line 283, in executing
    assert_(new_stmts <= stmts)
    ~~~~~~~^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\Jitto\Documents\Code\AICoding\aicoding\Lib\site-packages\executing\executing.py", line 80, in assert_
    raise AssertionError(str(message))
AssertionError